Repository: czhovo/chekinana
Catalog: ios/Chekinana/Chekinana/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

# product.gallery.shot_filter.solo
source: solo
ja: ソロ
zh_hans: 单人
zh_hant: 單人

# product.gallery.shot_filter.two_shot
source: 2-shot
ja: 2ショット
zh_hans: 双人
zh_hant: 雙人

# product.gallery.shot_type
source: Shot type
ja: 撮影タイプ
zh_hans: 拍摄类型
zh_hant: 拍攝類型

# product.gallery.sort_by
source: Sort by
ja: 並び順
zh_hans: 排序方式
zh_hant: 排序方式

# product.gallery.sort.ascending
source: Ascending
ja: 昇順
zh_hans: 升序
zh_hant: 遞增

# product.gallery.sort.descending
source: Descending
ja: 降順
zh_hans: 降序
zh_hant: 遞減

# product.gallery.sort.idol
source: Idol order
ja: アイドル順
zh_hans: 偶像顺序
zh_hant: 偶像順序

# product.gallery.sort.idol.ascending
source: Idol name ascending
ja: アイドル名の昇順
zh_hans: 偶像名称升序
zh_hant: 偶像名稱遞增

# product.gallery.sort.idol.descending
source: Idol name descending
ja: アイドル名の降順
zh_hans: 偶像名称降序
zh_hant: 偶像名稱遞減

# product.gallery.sort.time
source: Time
ja: 日時
zh_hans: 时间
zh_hant: 時間

# product.gallery.sort.time.ascending
source: Oldest first
ja: 古い順
zh_hans: 最早优先
zh_hant: 最早優先

# product.gallery.sort.time.descending
source: Newest first
ja: 新しい順
zh_hans: 最新优先
zh_hant: 最新優先

# product.gallery.viewer.edit_hint
source: Tap to edit this Cheki
ja: タップしてこのチェキを編集
zh_hans: 点击编辑这张拍立得
zh_hant: 點一下以編輯這張拍立得

# product.idols.add
source: Add Idol
ja: アイドルを追加
zh_hans: 添加偶像
zh_hant: 新增偶像

# product.idols.avatar_cleanup_after_save
source: The Idol was saved, but its previous managed avatar still needs cleanup. Retry cleanup before closing.
ja: アイドルは保存されましたが、以前の管理対象アバターのクリーンアップが必要です。閉じる前に再試行してください。
zh_hans: 偶像已保存，但之前的托管头像仍需清理。请在关闭前重试清理。
zh_hant: 偶像已儲存，但先前的受管理頭像仍需清理。請在關閉前重試清理。

# product.idols.avatar_cleanup_database_failure
source: The database was not saved and the previous Idol/avatar reference remains unchanged. The new staged avatar still needs cleanup (save: %1$@; cleanup: %2$@). Retry cleanup before closing.
ja: データベースは保存されず、以前のアイドル／アバター参照も変更されていません。新しい準備済みアバターはクリーンアップが必要です（保存：%1$@、クリーンアップ：%2$@）。閉じる前に再試行してください。
zh_hans: 数据库未保存，原偶像/头像引用保持不变。新的暂存头像仍需清理（保存：%1$@；清理：%2$@）。请在关闭前重试。
zh_hant: 資料庫未儲存，原有偶像／頭像參照保持不變。新的暫存頭像仍需清理（儲存：%1$@；清理：%2$@）。請在關閉前重試。

# product.idols.avatar_cleanup_required
source: Avatar Cleanup Needed
ja: アバターのクリーンアップが必要です
zh_hans: 需要清理头像
zh_hant: 需要清理頭像

# product.idols.avatar_cleanup_required_after_save
source: The Idol was saved, but an old managed avatar still requires cleanup.
ja: アイドルは保存されましたが、古い管理対象アバターのクリーンアップが必要です。
zh_hans: 偶像已保存，但旧的托管头像仍需清理。
zh_hant: 偶像已儲存，但舊有的受管理頭像仍需清理。

# product.idols.avatar_cleanup_retry_after_save
source: Idol is saved, but old avatar cleanup still failed: %@
ja: アイドルは保存済みですが、古いアバターのクリーンアップに失敗しました：%@
zh_hans: 偶像已保存，但旧头像清理仍失败：%@
zh_hant: 偶像已儲存，但舊頭像清理仍失敗：%@

# product.idols.avatar_cleanup_without_save
source: The Idol was not saved, but its staged avatar still needs cleanup. Retry cleanup before closing.
ja: アイドルは保存されていませんが、準備済みアバターのクリーンアップが必要です。閉じる前に再試行してください。
zh_hans: 偶像未保存，但暂存头像仍需清理。请在关闭前重试清理。
zh_hant: 偶像未儲存，但暫存頭像仍需清理。請在關閉前重試清理。

# product.idols.avatar_database_save_failed
source: The Idol was not saved. Review the form and try again.
ja: アイドルは保存されませんでした。フォームを確認して再試行してください。
zh_hans: 偶像未保存。请检查表单后重试。
zh_hant: 偶像未儲存。請檢查表單後重試。

# product.idols.avatar_repair.missing_catalogue_identity
source: %@ has no valid managed avatar and no catalogue identity. Edit this Idol and choose a local reference photo, then retry.
ja: %@には有効な管理対象アバターもカタログIDもありません。このアイドルを編集してローカルの参照写真を選び、再試行してください。
zh_hans: %@既没有有效的托管头像，也没有偶像资料库身份。请编辑此偶像并选择本地参考照片，然后重试。
zh_hant: %@沒有有效的受管理頭像，也沒有偶像資料庫身分。請編輯此偶像並選擇本機參考照片，然後重試。

# product.idols.avatar.cancel_selection
source: Cancel selection
ja: 選択をキャンセル
zh_hans: 取消选择
zh_hant: 取消選擇

# product.idols.avatar.choose
source: Choose avatar
ja: アバターを選択
zh_hans: 选择头像
zh_hant: 選擇頭像

# product.idols.avatar.picker.hint
source: Opens the photo library. Cancelling keeps the current avatar.
ja: 写真ライブラリを開きます。キャンセルしても現在のアバターは変わりません。
zh_hans: 打开照片图库。取消后会保留当前头像。
zh_hant: 開啟照片圖庫。取消後會保留目前的頭像。

# product.idols.avatar.preparation_failed
source: Avatar could not be prepared. Retry or cancel this selection: %@
ja: アバターを準備できませんでした。再試行するか、この選択をキャンセルしてください：%@
zh_hans: 无法准备头像。请重试或取消本次选择：%@
zh_hant: 無法準備頭像。請重試或取消本次選擇：%@

# product.idols.avatar.preparing
source: Preparing avatar…
ja: アバターを準備中…
zh_hans: 正在准备头像…
zh_hant: 正在準備頭像…

# product.idols.avatar.remove
source: Remove avatar
ja: アバターを削除
zh_hans: 移除头像
zh_hant: 移除頭像

# product.idols.avatar.replace
source: Replace avatar
ja: アバターを変更
zh_hans: 更换头像
zh_hant: 更換頭像

# product.idols.avatar.retry_for
source: Retry avatar for %@
ja: %@のアバターを再試行
zh_hans: 重试%@的头像
zh_hant: 重試%@的頭像

# product.idols.birthday
source: Birthday
ja: 誕生日
zh_hans: 生日
zh_hant: 生日

# product.idols.birthday_confirm_year
source: Confirm selected year
ja: 選択した年を確定
zh_hans: 确认所选年份
zh_hant: 確認所選年份

# product.idols.birthday_confirm_year.detail
source: Confirm the year before saving a full birthday.
ja: 年月日を保存する前に年を確定してください。
zh_hans: 保存完整生日之前，请确认年份。
zh_hant: 儲存完整生日之前，請確認年份。

# product.idols.birthday_invalid
source: Unable to normalize the selected birthday.
ja: 選択した誕生日を正規化できません。
zh_hans: 无法规范化所选生日。
zh_hant: 無法正規化所選生日。

# product.idols.birthday_invalid_value
source: Invalid
ja: 無効
zh_hans: 无效
zh_hant: 無效

# product.idols.birthday_mode.full_date
source: Full date
ja: 年月日
zh_hans: 完整日期
zh_hant: 完整日期

# product.idols.birthday_mode.unknown_year
source: Year unknown
ja: 生年不明
zh_hans: 年份未知
zh_hant: 年份未知

# product.idols.birthday_precision
source: Birthday precision
ja: 誕生日の精度
zh_hans: 生日精度
zh_hant: 生日精確度

# product.idols.birthday_unrecognized
source: The stored birthday could not be recognized. It will be preserved until you choose a date.
ja: 保存済みの誕生日を認識できません。日付を選択するまでは元の値を保持します。
zh_hans: 无法识别已存生日。在选择日期前会保留原值。
zh_hant: 無法辨識已儲存的生日。在選擇日期前會保留原值。

# product.idols.birthday_value_invalid
source: Birthday must be a valid full date or month and day.
ja: 誕生日には有効な年月日、または月日を指定してください。
zh_hans: 生日必须是有效的年月日或月日。
zh_hant: 生日必須是有效的年月日或月日。

# product.idols.birthday_year_unknown
source: Birth year is unknown. Choose the full date below to add it; otherwise the month and day are preserved.
ja: 生年は不明です。追加する場合は下で年月日を選択してください。選択しなければ月日は保持されます。
zh_hans: 出生年份未知。如需补充，请在下方选择完整年月日；否则会保留月日。
zh_hant: 出生年份未知。如需補充，請在下方選擇完整年月日；否則會保留月日。

# product.idols.birthday_year_unknown.detail
source: Only month and day are saved; no year is assumed.
ja: 月日のみ保存し、年は推測しません。
zh_hans: 仅保存月和日，不会推测年份。
zh_hant: 僅儲存月和日，不會推測年份。

# product.idols.catalogue_autofill
source: Auto-fills name, group, color, birthday, avatar, verification, and bio
ja: 名前、グループ、カラー、誕生日、アバター、認証情報、プロフィールを自動入力します
zh_hans: 自动填写姓名、团体、颜色、生日、头像、认证信息和简介
zh_hant: 自動填寫姓名、團體、顏色、生日、頭像、認證資訊及簡介

# product.idols.catalogue_avatar_for
source: Avatar for %@
ja: %@のアバター
zh_hans: %@的头像
zh_hant: %@的頭像

# product.idols.catalogue_avatar_identity_mismatch
source: The prepared avatar does not match this catalogue Idol. Search and select the Idol again.
ja: 準備したアバターがこのカタログのアイドルと一致しません。アイドルをもう一度検索して選択してください。
zh_hans: 准备的头像与偶像资料库中的偶像不匹配。请重新搜索并选择偶像。
zh_hant: 準備的頭像與偶像資料庫中的偶像不符。請重新搜尋並選擇偶像。

# product.idols.catalogue.use_information
source: Use %@ catalogue information
ja: %@のカタログ情報を使用
zh_hans: 使用%@的偶像资料库信息
zh_hant: 使用%@的偶像資料庫資訊

# product.idols.delete
source: Delete Idol
ja: アイドルを削除
zh_hans: 删除偶像
zh_hant: 刪除偶像

# product.idols.delete.avatar_cleanup_failed
source: The Idol was deleted, but its managed avatar could not be removed. Retry cleanup or close and leave the harmless orphaned file.
ja: アイドルは削除されましたが、管理対象のアバターを削除できませんでした。クリーンアップを再試行するか、閉じて無害な孤立ファイルを残してください。
zh_hans: 偶像已删除，但无法移除其托管头像。可重试清理，或关闭并保留这个无害的孤立文件。
zh_hant: 偶像已刪除，但無法移除其受管理頭像。可重試清理，或關閉並保留這個無害的孤立檔案。

# product.idols.delete.avatar_cleanup_retry_failed
source: The Idol is deleted, but avatar cleanup still failed: %@
ja: アイドルは削除済みですが、アバターのクリーンアップに失敗しました：%@
zh_hans: 偶像已删除，但头像清理仍失败：%@
zh_hant: 偶像已刪除，但頭像清理仍失敗：%@

# product.idols.delete.changed_associations
source: The Idol or its associated records changed. Request deletion again to review the updated impact.
ja: Idol または関連レコードが変更されました。削除をもう一度依頼し、最新の削除対象を確認してください。
zh_hans: Idol 或其关联记录已更改。请重新请求删除，确认最新的删除范围。
zh_hant: Idol 或其關聯記錄已變更。請重新請求刪除，確認最新的刪除範圍。

# product.idols.delete.confirm.message
source: This cannot be undone. An Idol with linked records cannot be deleted.
ja: この操作は取り消せません。関連する記録があるアイドルは削除できません。
zh_hans: 此操作无法撤销。有关联记录的偶像无法删除。
zh_hant: 此操作無法復原。有關聯記錄的偶像無法刪除。

# product.idols.delete.confirm.title
source: Delete this Idol?
ja: このアイドルを削除しますか？
zh_hans: 删除这个偶像？
zh_hant: 刪除這位偶像？

# product.idols.delete.error.linked_records
source: This Idol has %lld linked Cheki record(s). Reassign them before deleting.
ja: このアイドルには関連するチェキ記録が%lld件あります。削除する前に割り当てを変更してください。
zh_hans: 此偶像有%lld条关联拍立得记录。请先重新分配再删除。
zh_hant: 此偶像有 %lld 筆關聯拍立得記錄。請先重新分配再刪除。

# product.idols.edit
source: Edit Idol
ja: アイドルを編集
zh_hans: 编辑偶像
zh_hant: 編輯偶像

# product.idols.empty.detail
source: Add an Idol to link Cheki and enable on-device recognition after storing patterns.
ja: アイドルを追加するとチェキを関連付けられ、パターン保存後は端末内認識も利用できます。
zh_hans: 添加偶像后可关联拍立得，并在保存模式后使用本机识别。
zh_hant: 新增偶像後可關聯拍立得，並在儲存模式後使用本機辨識。

# product.idols.empty.title
source: No Idols yet
ja: アイドルはまだいません
zh_hans: 还没有偶像
zh_hant: 尚未新增偶像

# product.idols.hide
source: Hide Idol
ja: アイドルを非表示
zh_hans: 隐藏偶像
zh_hant: 隱藏偶像

# product.idols.hide.confirm.action
source: Hide Idol
ja: アイドルを非表示
zh_hans: 隐藏偶像
zh_hant: 隱藏偶像

# product.idols.hide.confirm.message
source: This Idol will disappear from visible lists. You can unhide it in Settings.
ja: このアイドルは表示中の一覧から非表示になります。設定から再表示できます。
zh_hans: 此偶像将从可见列表中隐藏。你可以在设置中取消隐藏。
zh_hant: 此偶像將從可見清單中隱藏。你可以在設定中取消隱藏。

# product.idols.hide.confirm.title
source: Hide this Idol?
ja: このアイドルを非表示にしますか？
zh_hans: 隐藏这个偶像？
zh_hant: 隱藏這位偶像？

# product.idols.include_birthday
source: Include birthday
ja: 誕生日を設定
zh_hans: 设置生日
zh_hant: 設定生日

# product.idols.merge.action
source: Merge into Selected Idol
ja: 選択したアイドルに統合
zh_hans: 合并到所选偶像
zh_hant: 合併至所選偶像

# product.idols.merge.avatar_cleanup_failed
source: The Idols were merged, but the deleted Idol's managed avatar could not be removed. Retry cleanup or close and leave the harmless orphaned file.
ja: アイドルの統合は完了しましたが、削除したアイドルの管理アバターを削除できませんでした。再試行するか、閉じて無害な孤立ファイルを残してください。
zh_hans: 偶像已合并，但无法移除被删除偶像的托管头像。可重试清理，或关闭并保留这个无害的孤立文件。
zh_hant: 偶像已合併，但無法移除已刪除偶像的受管理頭像。可重試清理，或關閉並保留這個無害的孤立檔案。

# product.idols.merge.avatar_cleanup_retry_failed
source: The Idols are merged, but avatar cleanup still failed: %@
ja: アイドルは統合済みですが、アバターのクリーンアップに再び失敗しました：%@
zh_hans: 偶像已合并，但头像清理仍然失败：%@
zh_hant: 偶像已合併，但頭像清理仍失敗：%@

# product.idols.merge.completed
source: Idols Merged
ja: アイドルを統合しました
zh_hans: 偶像已合并
zh_hant: 偶像已合併

# product.idols.merge.confirm.action
source: Merge and Delete Current Idol
ja: 統合して現在のアイドルを削除
zh_hans: 合并并删除当前偶像
zh_hant: 合併並刪除目前的偶像

# product.idols.merge.confirm.message
source: The target Idol “%1$@” keeps all of its profile and settings. The current Idol “%2$@” will be deleted after its records are moved.
ja: 統合先のアイドル「%1$@」のプロフィールと設定はすべて保持されます。記録の移動後、現在のアイドル「%2$@」は削除されます。
zh_hans: 目标偶像“%1$@”的全部资料和设置都会保留。记录转移后，当前偶像“%2$@”将被删除。
zh_hant: 目標偶像「%1$@」的所有資料和設定都會保留。記錄轉移後，目前的偶像「%2$@」將被刪除。

# product.idols.merge.confirm.title
source: Merge Idols?
ja: アイドルを統合しますか？
zh_hans: 合并偶像？
zh_hant: 合併偶像？

# product.idols.merge.error.same_idol
source: An Idol cannot be merged into itself.
ja: 同じアイドル自身には統合できません。
zh_hans: 偶像不能合并到自身。
zh_hant: 偶像無法合併至自身。

# product.idols.merge.error.source_missing
source: The Idol being merged no longer exists. Close this editor and try again.
ja: 統合するアイドルはすでに存在しません。この編集画面を閉じて再試行してください。
zh_hans: 要合并的偶像已不存在。请关闭编辑器后重试。
zh_hant: 要合併的偶像已不存在。請關閉編輯器後重試。

# product.idols.merge.error.target_missing
source: The selected target Idol no longer exists. Choose another target and try again.
ja: 選択した統合先アイドルはすでに存在しません。別の統合先を選んで再試行してください。
zh_hans: 所选目标偶像已不存在。请选择其他目标后重试。
zh_hant: 所選目標偶像已不存在。請選擇其他目標後重試。

# product.idols.merge.section
source: Merge into Existing Idol
ja: 既存のアイドルに統合
zh_hans: 合并到已有偶像
zh_hant: 合併至現有偶像

# product.idols.merge.select
source: Select an Idol
ja: アイドルを選択
zh_hans: 选择偶像
zh_hant: 選擇偶像

# product.idols.merge.target
source: Target Idol
ja: 統合先アイドル
zh_hans: 目标偶像
zh_hant: 目標偶像

# product.idols.merge.unavailable
source: There are no visible Idols available as a merge target.
ja: 統合先にできる表示中のアイドルがありません。
zh_hans: 没有可作为合并目标的可见偶像。
zh_hant: 沒有可作為合併目標的可見偶像。

# product.idols.name
source: Idol name
ja: アイドル名
zh_hans: 偶像名称
zh_hant: 偶像名稱

# product.idols.no_media_group.changed
source: This Cheki group changed. Reopen it and try again.
ja: このチェキグループは変更されました。開き直して再試行してください。
zh_hans: 此拍立得分组已变化。请重新打开后再试。
zh_hant: 此拍立得群組已變更。請重新開啟後再試。

# product.idols.no_media_group.edit
source: Edit group
ja: グループを編集
zh_hans: 编辑分组
zh_hant: 編輯群組

# product.idols.no_pattern_stored
source: No pattern stored
ja: パターン未登録
zh_hans: 未存储模式
zh_hant: 未儲存模式

# product.idols.open_detail_hint
source: Open Idol details.
ja: アイドルの詳細を開きます。
zh_hans: 打开偶像详情。
zh_hant: 開啟偶像的詳細資訊。

# product.idols.open_detail_reorder_hint
source: Open Idol details. Use the drag handle to reorder within the favorite group.
ja: アイドルの詳細を開きます。ドラッグハンドルでお気に入りグループ内を並べ替えられます。
zh_hans: 打开偶像详情。使用拖动手柄可在收藏组内重新排序。
zh_hant: 開啟偶像的詳細資訊。使用拖移控制點可在收藏群組內重新排序。

# product.idols.pattern.remove.confirm.message
source: The pattern will be removed from this draft. Save the Idol to make the change permanent.
ja: パターンはこの下書きから削除されます。変更を確定するにはアイドルを保存してください。
zh_hans: 模式将从此草稿中移除。请保存偶像以永久应用更改。
zh_hant: 模式將從此草稿中移除。請儲存偶像以永久套用變更。

# product.idols.pattern.remove.confirm.title
source: Remove this pattern?
ja: このパターンを削除しますか？
zh_hans: 移除此模式？
zh_hant: 移除此模式？

# product.idols.recognition
source: Recognition
ja: 認識
zh_hans: 识别
zh_hant: 辨識

# product.idols.reference.detail
source: The original photo will be encoded on this device. For a new Idol it also becomes the avatar.
ja: 元の写真はこの端末でエンコードされます。新しいアイドルの場合はアバターにもなります。
zh_hans: 原始照片将在本机编码；对于新偶像，它也会用作头像。
zh_hant: 原始照片將在本機編碼；對於新偶像，它也會用作頭像。

# product.idols.reorder_changed
source: The Cheki list changed. Reopen this date and try again.
ja: チェキ一覧が変更されました。この日付を開き直して再試行してください。
zh_hans: 拍立得列表已变化。请重新打开该日期后再试。
zh_hant: 拍立得清單已變更。請重新開啟該日期後再試。

# product.idols.reorder_failed
source: Unable to reorder
ja: 並べ替えできません
zh_hans: 无法重新排序
zh_hant: 無法重新排序

# product.idols.title
source: Idols
ja: 推し
zh_hans: 偶像
zh_hant: 偶像

# product.idols.unhide
source: Unhide
ja: 再表示
zh_hans: 取消隐藏
zh_hant: 取消隱藏

# product.idols.unhide.confirm.message
source: Show %@ in visible lists again?
ja: %@を一覧に再表示しますか？
zh_hans: 要在列表中重新显示%@吗？
zh_hant: 要在清單中重新顯示%@嗎？

# product.memory.add
source: Add Memory
ja: 思い出を追加
zh_hans: 添加回忆
zh_hant: 新增回憶

# product.memory.add.image
source: Add Image
ja: 画像を追加
zh_hans: 添加图片
zh_hant: 新增圖片

# product.memory.add.video
source: Add Video
ja: 動画を追加
zh_hans: 添加视频
zh_hant: 新增影片

# product.memory.attachment.image
source: Image
ja: 画像
zh_hans: 图片
zh_hant: 圖片

# product.memory.attachment.open_hint
source: Open this attachment
ja: この添付を開く
zh_hans: 打开此附件
zh_hant: 開啟此附件

# product.memory.attachment.unavailable
source: Attachment unavailable
ja: 添付を表示できません
zh_hans: 附件不可用
zh_hant: 無法使用附件

# product.memory.attachment.video
source: Video
ja: 動画
zh_hans: 视频
zh_hant: 影片

# product.memory.attachments
source: Attachments
ja: 添付
zh_hans: 附件
zh_hant: 附件

# product.memory.body
source: Body
ja: 本文
zh_hans: 正文
zh_hant: 正文

# product.memory.body.empty
source: No body text
ja: 本文なし
zh_hans: 正文为空
zh_hant: 沒有正文

# product.memory.content
source: Content
ja: 内容
zh_hans: 内容
zh_hant: 內容

# product.memory.delete
source: Delete Memory
ja: 思い出を削除
zh_hans: 删除回忆
zh_hant: 刪除回憶

# product.memory.edit
source: Edit Memory
ja: 思い出を編集
zh_hans: 编辑回忆
zh_hant: 編輯回憶

# product.memory.error
source: Memory
ja: 思い出
zh_hans: 回忆
zh_hant: 回憶

# product.memory.relationships
source: Relationships
ja: 関連
zh_hans: 关联
zh_hant: 關聯

# product.memory.title
source: Title
ja: タイトル
zh_hans: 标题
zh_hant: 標題

# product.memory.validation.empty
source: Memory must contain at least one value.
ja: 思い出には少なくとも1つの内容が必要です。
zh_hans: 回忆至少需要填写一项内容。
zh_hant: 回憶至少需要填寫一項內容。

# product.memory.validation.invalid_attachment
source: A Memory attachment is invalid.
ja: 思い出の添付ファイルが無効です。
zh_hans: 回忆的附件无效。
zh_hant: 回憶的附件無效。

# product.memory.validation.invalid_date
source: The Memory date is outside the supported range.
ja: 思い出の日付が対応範囲外です。
zh_hans: 回忆日期超出支持范围。
zh_hant: 回憶日期超出支援範圍。

# product.scan.camera
source: Camera
ja: カメラ
zh_hans: 相机
zh_hant: 相機

# product.scan.camera.access_denied
source: Camera access is denied. Enable it in Settings to take photos.
ja: カメラへのアクセスが拒否されています。写真を撮るには設定で許可してください。
zh_hans: 相机访问已被拒绝。请在设置中授权后拍照。
zh_hant: 相機存取遭拒。請在設定中授權後拍照。

# product.scan.camera.access_restricted
source: Camera access is restricted on this device.
ja: このデバイスではカメラへのアクセスが制限されています。
zh_hans: 此设备限制了相机访问。
zh_hant: 此裝置限制了相機存取。

# product.scan.camera.capture_identity_lost
source: The camera capture identity was lost.
ja: カメラ撮影の識別情報が失われました。
zh_hans: 相机拍摄标识已丢失。
zh_hant: 相機拍攝識別資訊已遺失。

# product.scan.camera.capturing
source: Capturing full-resolution photo…
ja: フル解像度の写真を撮影中…
zh_hans: 正在拍摄全分辨率照片…
zh_hant: 正在拍攝完整解析度照片…

# product.scan.camera.configuration_failed
source: Unable to configure the camera: %@
ja: カメラを設定できません：%@
zh_hans: 无法配置相机：%@
zh_hant: 無法設定相機：%@

# product.scan.camera.configuration_unavailable
source: The rear camera cannot be configured for photos.
ja: 背面カメラを写真撮影用に設定できません。
zh_hans: 无法配置后置相机进行拍照。
zh_hant: 無法將後置相機設定為拍照模式。

# product.scan.camera.focus_failed
source: Unable to focus the camera: %@
ja: カメラのフォーカスに失敗しました：%@
zh_hans: 相机无法对焦：%@
zh_hant: 相機無法對焦：%@

# product.scan.camera.interruption_resume_failed
source: The camera remained unavailable after the interruption ended.
ja: 中断終了後もカメラを利用できません。
zh_hans: 中断结束后相机仍不可用。
zh_hant: 中斷結束後仍無法使用相機。

# product.scan.camera.interruption.audio_in_use
source: Camera audio is in use by another app.
ja: カメラのオーディオは別のアプリで使用中です。
zh_hans: 相机音频正被其他应用使用。
zh_hant: 相機音訊正被其他 App 使用。

# product.scan.camera.interruption.camera_in_use
source: The camera is in use by another app.
ja: カメラは別のアプリで使用中です。
zh_hans: 相机正被其他应用使用。
zh_hant: 相機正被其他 App 使用。

# product.scan.camera.interruption.generic
source: The camera session was interrupted.
ja: カメラセッションが中断されました。
zh_hans: 相机会话已中断。
zh_hant: 相機工作階段已中斷。

# product.scan.camera.interruption.multiple_apps
source: The camera is unavailable while multiple apps are in the foreground.
ja: 複数のアプリが前面にある間はカメラを利用できません。
zh_hans: 多个应用同时处于前台时无法使用相机。
zh_hant: 多個 App 同時位於前景時無法使用相機。

# product.scan.camera.interruption.system_pressure
source: The camera paused because of system pressure.
ja: システム負荷のためカメラを一時停止しました。
zh_hans: 由于系统负载，相机已暂停。
zh_hant: 由於系統負載，相機已暫停。

# product.scan.camera.keep_photo_failed
source: Unable to keep the captured photo: %@
ja: 撮影した写真を保持できません：%@
zh_hans: 无法保留拍摄的照片：%@
zh_hant: 無法保留拍攝的照片：%@

# product.scan.camera.media_services_restart_failed
source: Camera media services reset and could not restart.
ja: カメラのメディアサービスはリセット後に再起動できませんでした。
zh_hans: 相机媒体服务重置后无法重新启动。
zh_hant: 相機媒體服務重設後無法重新啟動。

# product.scan.camera.no_photo_data
source: The camera did not return photo data.
ja: カメラから写真データを取得できませんでした。
zh_hans: 相机未返回照片数据。
zh_hant: 相機未傳回照片資料。

# product.scan.camera.no_rear_camera
source: No rear camera is available on this device.
ja: このデバイスでは背面カメラを利用できません。
zh_hans: 此设备没有可用的后置相机。
zh_hant: 此裝置沒有可用的後置相機。

# product.scan.camera.open_settings
source: Open Settings
ja: 設定を開く
zh_hans: 打开设置
zh_hant: 開啟設定

# product.scan.camera.runtime_error
source: Camera runtime error: %@
ja: カメラの実行エラー：%@
zh_hans: 相机运行错误：%@
zh_hant: 相機執行錯誤：%@

# product.scan.camera.runtime_error_unknown
source: Unknown runtime error
ja: 不明な実行エラー
zh_hans: 未知运行错误
zh_hant: 未知執行錯誤

# product.scan.camera.session_resume_failed
source: The camera session could not resume.
ja: カメラセッションを再開できませんでした。
zh_hans: 无法恢复相机会话。
zh_hant: 無法恢復相機工作階段。

# product.scan.camera.session_start_failed
source: The camera session could not start.
ja: カメラセッションを開始できませんでした。
zh_hans: 无法启动相机会话。
zh_hant: 無法啟動相機工作階段。

# product.scan.camera.subtitle
source: Take a photo
ja: 写真を撮る
zh_hans: 拍摄照片
zh_hant: 拍攝照片

# product.scan.canceled
source: Canceled
ja: キャンセルしました
zh_hans: 已取消
zh_hant: 已取消

# product.scan.candidate_range
source: Candidate range
ja: 候補範囲
zh_hans: 候选范围
zh_hant: 候選範圍

# product.scan.candidates.none
source: No usable candidates
ja: 利用可能な候補がありません
zh_hans: 没有可用候选项
zh_hant: 沒有可用的候選項目

# product.scan.candidates.one
source: %lld Idol
ja: %lld人のアイドル
zh_hans: %lld位偶像
zh_hant: %lld 位偶像

# product.scan.candidates.other
source: %lld Idols
ja: %lld人のアイドル
zh_hans: %lld位偶像
zh_hant: %lld 位偶像

# product.scan.candidates.title
source: Candidates
ja: 候補
zh_hans: 候选范围
zh_hant: 候選範圍

# product.scan.candidates.unassigned_hint
source: If the Idol may be outside the selected range, enable Unassigned.
ja: アイドルが選択範囲外の可能性がある場合は、「未割り当て」を有効にしてください。
zh_hans: 如果偶像可能不在所选范围内，请启用“未分配”。
zh_hant: 如果偶像可能不在所選範圍內，請啟用「未分配」。

# product.scan.candidates.unassigned_only
source: Unassigned only · no stored patterns
ja: 未割り当てのみ · 保存済みパターンなし
zh_hans: 仅未分配 · 没有已存模式
zh_hant: 僅未分配 · 沒有已儲存的模式

# product.scan.candidates.with_unassigned
source: %@ + Unassigned
ja: %@ + 未割り当て
zh_hans: %@ + 未分配
zh_hant: %@ + 未分配

# product.scan.clear
source: Clear
ja: クリア
zh_hans: 清除
zh_hant: 清除

# product.scan.date_configuration_invalid
source: The date configuration is invalid. Please choose again.
ja: 日付設定が無効です。選び直してください。
zh_hans: 日期设置无效，请重新选择。
zh_hant: 日期設定無效，請重新選擇。

# product.scan.error.no_result
source: The scanner returned no result.
ja: スキャナーから結果が返されませんでした。
zh_hans: 扫描服务没有返回结果。
zh_hant: 掃描服務沒有傳回結果。

# product.scan.error.read_photo
source: Unable to read the selected photo.
ja: 選択した写真を読み込めません。
zh_hans: 无法读取所选照片。
zh_hant: 無法讀取所選照片。

# product.scan.error.unexpected_result
source: The scanner returned an unexpected result.
ja: スキャナーから予期しない結果が返されました。
zh_hans: 扫描服务返回了意外结果。
zh_hant: 掃描服務傳回非預期的結果。

# product.scan.fixed_date
source: Fixed date
ja: 日付を固定
zh_hans: 固定日期
zh_hant: 固定日期

# product.scan.gpu.inputs_paused
source: Camera and Photos are temporarily unavailable. Import Cheki remains available.
ja: カメラと写真は一時的に利用できません。チェキの読み込みは利用できます。
zh_hans: 相机和照片暂时不可用，仍可导入拍立得。
zh_hant: 暫時無法使用相機和照片，仍可匯入拍立得。

# product.scan.gpu.refresh
source: Refresh GPU status
ja: GPU状態を更新
zh_hans: 刷新GPU状态
zh_hant: 重新整理 GPU 狀態

# product.scan.gpu.start
source: Start
ja: 開始
zh_hans: 启动
zh_hant: 啟動

# product.scan.gpu.terminate
source: Terminate
ja: 停止
zh_hans: 终止
zh_hant: 終止

# product.scan.import_cheki
source: Import Cheki
ja: チェキを読み込む
zh_hans: 导入拍立得
zh_hant: 匯入拍立得

# product.scan.import_cheki.subtitle
source: Skip extraction
ja: 切り出しを省略
zh_hans: 跳过提取
zh_hant: 略過擷取

# product.scan.input_photos
source: Input photos
ja: 入力写真
zh_hans: 输入照片
zh_hant: 輸入照片

# product.scan.input.delete
source: Delete input photo
ja: 入力写真を削除
zh_hans: 删除输入照片
zh_hant: 刪除輸入照片

# product.scan.input.delete_hint
source: Removes only this photo from the scan inputs.
ja: スキャン入力からこの写真だけを削除します。
zh_hans: 仅从扫描输入中删除这张照片。
zh_hant: 僅從掃描輸入中刪除這張照片。

# product.scan.input.preview_unavailable
source: Photo preview unavailable
ja: 写真をプレビューできません
zh_hans: 无法预览照片
zh_hant: 無法預覽照片

# product.scan.input.rotate
source: Rotate input photo
ja: 入力写真を回転
zh_hans: 旋转输入照片
zh_hant: 旋轉輸入照片

# product.scan.input.rotate_counterclockwise
source: Rotate input photo counterclockwise
ja: 入力写真を反時計回りに回転
zh_hans: 逆时针旋转输入照片
zh_hant: 逆時針旋轉輸入照片

# product.scan.input.rotate_failed
source: Couldn't rotate this input photo. The original is unchanged.
ja: この入力写真を回転できませんでした。元の写真は変更されていません。
zh_hans: 无法旋转这张输入照片，原图保持不变。
zh_hant: 無法旋轉這張輸入照片，原圖保持不變。

# product.scan.input.rotate_hint
source: Rotates only this input photo counterclockwise.
ja: この入力写真だけを反時計回りに回転します。
zh_hans: 仅将这张输入照片逆时针旋转。
zh_hant: 僅將這張輸入照片逆時針旋轉。

# product.scan.mode.disabled
source: Disabled
ja: 無効
zh_hans: 禁用
zh_hant: 停用

# product.scan.mode.enabled
source: Enabled
ja: 有効
zh_hans: 启用
zh_hant: 啟用

# product.scan.mode.specified
source: Specified
ja: 指定
zh_hans: 指定
zh_hant: 指定

# product.scan.phase.completed
source: Extraction complete
ja: 切り出し完了
zh_hans: 提取完成
zh_hant: 擷取完成

# product.scan.phase.detecting
source: Detecting Cheki
ja: チェキを検出中
zh_hans: 正在检测拍立得
zh_hant: 正在偵測拍立得
